In [1]:
import pandas as pd

In [2]:
#Converting Dictionary to DataFrame

one=pd.DataFrame({
        'name':[1,2,3,4,5],
        'dep_name':['CSE','ECE','Mech','Civil','EEE'],
        'marks':[20,30,40,50,60]
    })

In [28]:
two=pd.DataFrame({
        'name':[6,7,8,9,10],
        'dep_name':['CSE','ECE','Mech','Civil','EEE'],
        'marks':[60,30,90,50,50]
    })

In [3]:
one

  dep_name  marks  name
0      CSE     20     1
1      ECE     30     2
2     Mech     40     3
3    Civil     50     4
4      EEE     60     5

In [4]:
# Finding missing values in each column

one.isnull().sum()

dep_name    0
marks       0
name        0
dtype: int64

In [5]:
# Dropping the missing values

one.dropna()

  dep_name  marks  name
0      CSE     20     1
1      ECE     30     2
2     Mech     40     3
3    Civil     50     4
4      EEE     60     5

In [6]:
# Grouping the data

one.groupby('marks').dep_name.value_counts()

marks  dep_name
20     CSE         1
30     ECE         1
40     Mech        1
50     Civil       1
60     EEE         1
Name: dep_name, dtype: int64

In [9]:
#finding the unique values

marks_unique=one.marks.unique()
dep_name_unique=one.dep_name.unique()
name_unique=one.name.unique()

print(marks_unique)
print(dep_name_unique)
print(name_unique)

[20 30 40 50 60]
['CSE' 'ECE' 'Mech' 'Civil' 'EEE']
[1 2 3 4 5]

In [10]:
#Length of dataframe

len(one)

5

# Filtering the Data

In [12]:
# Filtering the data with single condition

one[one['marks']>20]

  dep_name  marks  name
1      ECE     30     2
2     Mech     40     3
3    Civil     50     4
4      EEE     60     5

In [14]:
one[one['dep_name']=='Mech']

  dep_name  marks  name
2     Mech     40     3

In [18]:
# Filtering the data with Multiple conditions

one[(one['marks']>20) & (one['name']==4)]

  dep_name  marks  name
3    Civil     50     4

In [20]:
one[(one['marks']>20) & (one['dep_name']=='Mech')]

  dep_name  marks  name
2     Mech     40     3

In [21]:
#Filtering data through values

one[one['marks'].isin([20,30,40])]

  dep_name  marks  name
0      CSE     20     1
1      ECE     30     2
2     Mech     40     3

In [25]:
#Pivoting the data(Reshape the dataframe by changing indexes and values)


one.pivot(index='dep_name',columns='name',values='marks')

name         1     2     3     4     5
dep_name
CSE       20.0   NaN   NaN   NaN   NaN
Civil      NaN   NaN   NaN  50.0   NaN
ECE        NaN  30.0   NaN   NaN   NaN
EEE        NaN   NaN   NaN   NaN  60.0
Mech       NaN   NaN  40.0   NaN   NaN

In [27]:
#Melting the dataset(Unpivoting the dataframe)

one.melt(id_vars='dep_name',value_name='marks').tail()

AttributeError: 'DataFrame' object has no attribute 'melt'

In [30]:
#Concatinating data

pd.concat([one,two])

  dep_name  marks  name
0      CSE     20     1
1      ECE     30     2
2     Mech     40     3
3    Civil     50     4
4      EEE     60     5
0      CSE     60     6
1      ECE     30     7
2     Mech     90     8
3    Civil     50     9
4      EEE     50    10

In [32]:
#Exporting data to excel

one.to_excel('one.xlsx')

# Aggregating data

In [33]:
#Lets create a dataframe 

import numpy as np
df=pd.DataFrame(np.random.randn(7,3),index=pd.date_range('1/1/2019',periods=7),columns=['A','B','C'])

In [34]:
df

                   A         B         C
2019-01-01  0.339950 -0.825089  0.073359
2019-01-02 -0.912133 -0.604456 -2.091972
2019-01-03  2.302953 -0.603582  0.499649
2019-01-04 -0.812643 -0.857462 -0.616131
2019-01-05 -0.268129  1.369920 -1.124943
2019-01-06  0.387950 -0.851137 -1.038307
2019-01-07  1.596664 -0.332846  0.580044

In [37]:
#Aggregating the whole dataframe


aggr=df.rolling(window=3,min_periods=1)
aggr.aggregate(np.sum)

                   A         B         C
2019-01-01  0.339950 -0.825089  0.073359
2019-01-02 -0.572183 -1.429545 -2.018613
2019-01-03  1.730770 -2.033126 -1.518964
2019-01-04  0.578177 -2.065500 -2.208454
2019-01-05  1.222181 -0.091124 -1.241426
2019-01-06 -0.692822 -0.338680 -2.779381
2019-01-07  1.716485  0.185937 -1.583206